# StairsStartHigherThanEnd Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairsStartHigherThanEnd Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The stairs' base (Base Level + Base Offset) must be below its top (Top Level + Top Offset).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairsStartHigherThanEnd { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsStartHigherThanEnd As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairsStartHigherThanEnd {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace